package day0621;

public class WhileTest_01 {

	public static void main(String[] args) {
		// 반복문
		/*
		 * 1. for(초기값;조건식;증감식){
		 * 문장;
		 * }
		 * =>반복횟수가 정해져있는 경우에 많이 씀(예:배열)
		 * 
		 * 2.while(조건식){
		 * 문장;
		 * }
		 * =>조건이 참일동안 반복실행.. 조건이안맞으면 한번도 실행안함(선조건)
		 * 
		 * 3.do{
		 *   문장;
		 * }while(조건식){
		 *  문장;
		 * }
		 * =>조건식이 처음부터 맞지 않더라도 do 안 문장 한번은 실행(후조건)
		 * 
		 * 4.break; 
		 *  현재 속한 반복문들 빠져나간다.
		 *  
		 *  break label(단순한 네이밍);
		 * 		:label이 선언딘 반복문을 빠져나온다(한번에 두개이상도 탈출가능)
		 * 
		 * 5.continue;
		 * 		반복문에서 continue를 만나면 남은코드를 실행하지 않고
		 * 		조건식(while) 증감식(for)문으로 이동한다.
		 * 
		 * */
	}

}
